AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

AccumulationRegisters/ПартииМалоценкиВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииМалоценкиВЭксплуатации</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийПартииМалоценкиВЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Запись сформирована при списании партий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартияМалоценкиВЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПередачаМалоценкиВЭксплуатацию</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатковМалоценкиВЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияИспользования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатковМалоценкиВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.Партия</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СписаннаяМалоценкаВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СписаннаяМалоценкаВЭксплуатации</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражатьВНалоговомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийПартииМалоценкиВЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазначениеИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияИспользования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеКуда</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииКуда</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФизЛицоКуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КачествоНовое</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазначениеИспользованияНовое</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияИспользования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПартияМалоценкиВЭксплуатации</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПартияМалоценкиВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаМалоценкиВЭксплуатацию</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатковМалоценкиВЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УказыватьПартию</Name>
					<Comment>Если истина, то пользователь должен указывать для материалов документ передачи их в эксплуатацию.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиДокумента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыМалоценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыМалоценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МалоценныйБыстроизнашивающийсяПредмет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МалоценныйНеоборотныйАктив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БиблиотечныеФонды</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ГруппыНалоговыхНазначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ГруппыНалоговыхНазначений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалоговыеНазначенияДоНКУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыеНазначенияАктивовИВзаиморасчетовПоНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалоговыеНазначенияДоходовИЗатрат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/УправлениеМалоценнымиАктивами/Ext/Module.bsl
#Если Клиент Тогда

// Процедура вызывается из НачалоВыбораТипа()
// и открывает формы выбора для выбранного типа.
//
Процедура ОткрытьФормуДляВыбораЗначения(МетаданныеТипа, Элемент)

	Если Метаданные.Справочники.Содержит(МетаданныеТипа) Тогда
		
		ФормаВыбора = Справочники[МетаданныеТипа.Имя].ПолучитьФормуВыбора(, Элемент);
		
	Иначе
		
		ФормаВыбора = Документы[МетаданныеТипа.Имя].ПолучитьФормуВыбора(, Элемент);
		
	КонецЕсли;
	
	ФормаВыбора.Открыть();

КонецПроцедуры // ОткрытьФормуДляВыбораЗначения()
	
// Данная процедура облегчает выбор типа пользователем,
// для поля ввода с составным типом данных. 
// В составной тип данных должны входить только
// Справочники и документы.
// Процедура сначала обрабатывает ограничение типа, и только
// если оно не установлено, берется тип значения поля ввода.
//
// Параметры
// 	Элемент               – Тип: ПолеВвода – Поле ввода с составным типом
//                 
//  СтандартнаяОбработка  – Тип: Булево – Флаг стандарной обработки
//                 
//  Форма                 – Тип: Форма – Форма, которой принадлежит поле ввода.
//                 
//
Процедура НачалоВыбораТипа(Элемент, СтандартнаяОбработка, Форма) Экспорт

	Если Элемент.Значение = Неопределено Тогда
		// Выбор типа
		
		СтандартнаяОбработка = Ложь;
		СписокТипов = Новый СписокЗначений;
		// Сначала типы берутся из ограничения типов.
		МассивТипов = Элемент.ОграничениеТипа.Типы();
		
		Если МассивТипов.Количество() = 0 Тогда
			// Тогда типы берутся из типа значения
			
			МассивТипов = Элемент.ТипЗначения.Типы();
			
		КонецЕсли;
		
		КоличествоТипов = МассивТипов.Количество();
		
		Если КоличествоТипов = 1 Тогда
			// Выбирать нет необходимости
			
			МетаданныеТипа = Метаданные.НайтиПоТипу(МассивТипов[0]);
			ОткрытьФормуДляВыбораЗначения(МетаданныеТипа, Элемент);
			Возврат;
			
		КонецЕсли;
		
		ШиринаСписка = 0;
		
		Для каждого Тип Из МассивТипов Цикл
		
			МетаданныеТипа = Метаданные.НайтиПоТипу(Тип);
			Представление  = МетаданныеТипа.Представление();
			ШиринаСписка   = Макс(ШиринаСписка, СтрДлина(Представление) + 10);
			СписокТипов.Добавить(МетаданныеТипа, Представление);
		
		КонецЦикла;
		
		Элемент.ВысотаСпискаВыбора = Мин(15 , КоличествоТипов);
		Элемент.ШиринаСпискаВыбора = Мин(120, ШиринаСписка);
		
		Результат = Форма.ВыбратьИзСписка(СписокТипов,Элемент);
		
		Если Результат <> Неопределено Тогда
			
			ОткрытьФормуДляВыбораЗначения(Результат.Значение, Элемент);
			
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры // НачалоВыбораТипа()

#КонецЕсли

/////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ ПОГАШЕНИЯ СТОИМОСТИ

// Функция получает таблицу значений с указанием списка малоценки и сумм 
// погашения стоимости и возвращает таблицу значений с распределенными 
// значениями погашения стоимости.
//
Функция ПолучитьРаспределениеПогашенияСтоимости(ДокОбъект, Отказ, Заголовок, ТабАмортизации, СтруктураШапкиДокумента, НомерЖурнала, ТекстПроводки = Неопределено) Экспорт

	ДатаРасчета   = ДокОбъект.Дата;
    СуммаНа09Счет = 0;
	Если (ТабАмортизации.Колонки.Найти("НоменклатурнаяПозиция") = Неопределено) Тогда
		ТабАмортизации.Колонки.Добавить("НоменклатурнаяПозиция");
	КонецЕсли;
	
	// определим структуру выходной таблицы
	ТабЗатрат = Новый ТаблицаЗначений;
	ТабЗатрат.Колонки.Добавить("Сумма", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла( 15, 2));
	ТабЗатрат.Колонки.Добавить("СуммаНУ", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла( 15, 2));
	ТабЗатрат.Колонки.Добавить("НалоговоеНазначение",      		Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
	ТабЗатрат.Колонки.Добавить("НалоговоеНазначениеДоходовИЗатрат", 	Новый ОписаниеТипов("СправочникСсылка.НалоговыеНазначенияАктивовИЗатрат"));
	ТабЗатрат.Колонки.Добавить("СчетЗатрат");
	ТабЗатрат.Колонки.Добавить("СчетАмортизации");
	ТабЗатрат.Колонки.Добавить("ОбъектУчета");
	ТабЗатрат.Колонки.Добавить("НоменклатурнаяПозиция");
	ТабЗатрат.Колонки.Добавить("Субконто1");
	ТабЗатрат.Колонки.Добавить("Субконто2");
	ТабЗатрат.Колонки.Добавить("Субконто3");
	ТабЗатрат.Колонки.Добавить("Партия");
	ТабЗатрат.Колонки.Добавить("Склад");
	ТабЗатрат.Колонки.Добавить("Количество");

	МассивКоэф = Новый Массив;

	// цикл по Объектам из ТабАмортизации
	Для Каждого СтрокаТЗ Из ТабАмортизации Цикл

		Если СтрокаТЗ.Сумма=0 тогда
			//Распределять амортизацию не надо, так как распределять нечего.
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.НаправлениеАмортизации) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Для объекта %1 не указаны способы отражения расходов по амортизации';uk=""Для об'єкта %1 не вказані способи відображення витрат по амортизації"""), СтрокаТЗ.ОбъектУчета),,, СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		Если СтрокаТЗ.НаправлениеАмортизации.Способы.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Для объекта %1 в способах отражения затрат по амортизации нет записей';uk=""Для об'єкта %1 у способах відображення витрат по амортизації немає записів"""), СтрокаТЗ.ОбъектУчета),,, СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		МассивКоэф.Очистить();
		Для Каждого СтрокаНапр Из СтрокаТЗ.НаправлениеАмортизации.Способы Цикл
			МассивКоэф.Добавить(СтрокаНапр.Коэффициент);
		КонецЦикла;

		МассивСумм 		= ОбщегоНазначения.РаспределитьПропорционально(СтрокаТЗ.Сумма, МассивКоэф, 2);
		МассивСуммНУ 	= ОбщегоНазначения.РаспределитьПропорционально(СтрокаТЗ.СуммаНУ, МассивКоэф, 2);
		Если МассивСумм = Неопределено Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Для объекта %1 в способах отражения расходов по амортизации не проставлены коэффициенты';uk=""Для об'єкта %1 у способах відображення витрат по амортизації не проставлені коефіцієнти"""), СтрокаТЗ.ОбъектУчета),,, СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		Если МассивСумм.Количество() <> МассивКоэф.Количество() Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Для объекта %1 в способах отражения затрат по амортизации есть нулевые коэффициенты';uk=""Для об'єкта %1 у способах відображення витрат по амортизації є нульові коефіцієнти"""), СтрокаТЗ.ОбъектУчета),,, СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;

		НеМБП      = (СтрокаТЗ.ВидМалоценки <> Перечисления.ВидыМалоценки.МалоценныйБыстроизнашивающийсяПредмет);
		Количество = СтрокаТЗ.Количество;
		
		Для Каждого СтрокаНапр Из СтрокаТЗ.НаправлениеАмортизации.Способы Цикл
			
			Если ЗначениеЗаполнено(СтрокаНапр.ПодразделениеОрганизации) Тогда
				ПодразделениеОрганизации 	= СтрокаНапр.ПодразделениеОрганизации;
			Иначе	
				// получаем по местонахождению объекта
				ПодразделениеОрганизации 	= СтрокаТЗ.Местонахождение;
			КонецЕсли;	
			
			Если НЕ ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
				Если СтрокаТЗ.НаправлениеАмортизации <> Справочники.СпособыОтраженияРасходовПоАмортизации.ВременнаяРазницаОСНа01042011 
						И СтрокаТЗ.НаправлениеАмортизации <> Справочники.СпособыОтраженияРасходовПоАмортизации.ВременнаяРазницаОС_За2020 Тогда
					ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='В бух. учете для объекта ';uk=""В бух. обліку для об'єкта """) + СтрокаТЗ.ОбъектУчета + НСтр("ru=' не указано подразделение ни при принятии к учету, ни в способах отражения расходов. Необходимо заполнить подразделение и перепровести документ.';uk=' не вказаний підрозділ ні при прийнятті до обліку, ні в способах відображення витрат. Необхідно заповнити підрозділ і перепровести документ.'"),,, СтатусСообщения.Важное);
					Продолжить;
				КонецЕсли;	
			КонецЕсли;	
			
			НоваяСтрока = ТабЗатрат.Добавить();
			НоваяСтрока.СчетЗатрат            = СтрокаНапр.СчетЗатрат;
			НоваяСтрока.ОбъектУчета     	  = СтрокаТЗ.ОбъектУчета;
			НоваяСтрока.НоменклатурнаяПозиция = СтрокаТЗ.НоменклатурнаяПозиция;
			НоваяСтрока.СчетАмортизации       = СтрокаТЗ.СчетАмортизации;
			НоваяСтрока.Субконто1             = СтрокаНапр.Субконто1;
			НоваяСтрока.Субконто2             = СтрокаНапр.Субконто2;
			НоваяСтрока.Субконто3             = СтрокаНапр.Субконто3;
			
			Если ТипЗнч(НоваяСтрока.Субконто1) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
				НоваяСтрока.Субконто1 = ПодразделениеОрганизации;
			ИначеЕсли ТипЗнч(НоваяСтрока.Субконто2) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда	
				НоваяСтрока.Субконто2 = ПодразделениеОрганизации;
			ИначеЕсли ТипЗнч(НоваяСтрока.Субконто3) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда	
				НоваяСтрока.Субконто3 = ПодразделениеОрганизации;
			КонецЕсли;	
			
			НоваяСтрока.Партия                = СтрокаТЗ.Партия;
			НоваяСтрока.Склад                 = СтрокаТЗ.Склад;
			НоваяСтрока.Количество            = Количество;
			
			// Количество только в первой проводке.
			Количество = 0;
			
			СуммаЗатр         = МассивСумм[СтрокаНапр.НомерСтроки - 1];
			НоваяСтрока.Сумма = СуммаЗатр;
			
			Если МассивСуммНУ <> Неопределено Тогда
				НоваяСтрока.СуммаНУ = МассивСуммНУ[СтрокаНапр.НомерСтроки - 1];
			КонецЕсли;	
			НоваяСтрока.НалоговоеНазначениеДоходовИЗатрат = СтрокаНапр.НалоговоеНазначениеДоходовИЗатрат;
			
			НоваяСтрока.НалоговоеНазначение = СтрокаТЗ.НалоговоеНазначение;
			
			НалоговыйУчет.ОпределениеАналитикиНалоговогоУчетаВПроводкахДляЗатрат(НоваяСтрока, НоваяСтрока.СчетЗатрат, ,
																   	НоваяСтрока.НалоговоеНазначениеДоходовИЗатрат, ,                                           
																	НоваяСтрока.НалоговоеНазначение, НоваяСтрока.НалоговоеНазначениеДоходовИЗатрат,,Ложь,Ложь, ДатаРасчета
																	, 
																	, СтруктураШапкиДокумента.ЕстьНДС
																	);
			
			Если НеМБП Тогда
				
				СуммаНа09Счет = СуммаНа09Счет + СуммаЗатр;	
				
			КонецЕсли;	
				
		КонецЦикла;

	КонецЦикла;

	ДопПараметры = Новый Структура;
	
	//формирование проводок
	Проводки = ДокОбъект.Движения.Хозрасчетный;
	
	Для каждого СтрокаЗатрат из ТабЗатрат Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаЗатрат.Сумма) И НЕ ЗначениеЗаполнено(СтрокаЗатрат.Количество) Тогда
			Продолжить;
		КонецЕсли;
		
		Проводка = Проводки.Добавить();
		
		Проводка.Период       = ДатаРасчета;
		Проводка.Содержание   = ?(НЕ ЗначениеЗаполнено(ТекстПроводки), "Начислена амортизация", ТекстПроводки);
		Проводка.НомерЖурнала = НомерЖурнала;
		Проводка.Организация  = СтруктураШапкиДокумента.Организация;
		Проводка.Сумма        = СтрокаЗатрат.Сумма;
		
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 ИЛИ СтрокаЗатрат.НалоговоеНазначениеДоходовИЗатрат.ГруппаНалоговогоНазначения = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияАктивовИВзаиморасчетовПоНДС Тогда	
			Проводка.НалоговоеНазначениеДт      = СтрокаЗатрат.НалоговоеНазначениеДоходовИЗатрат;
		КонецЕсли;	
		
		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 
			И Проводка.НалоговоеНазначениеДт <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_НеХозДеятельность
		    И Проводка.НалоговоеНазначениеДт <> Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность Тогда
		
			Проводка.СуммаНУДт    = СтрокаЗатрат.СуммаНУ;
		КонецЕсли;	
		
		Проводка.СчетДт = СтрокаЗатрат.СчетЗатрат;
		ОбщегоНазначения.УстановитьСубконто(СтрокаЗатрат.СчетЗатрат, Проводка.СубконтоДт, 1, СтрокаЗатрат.Субконто1);
		ОбщегоНазначения.УстановитьСубконто(СтрокаЗатрат.СчетЗатрат, Проводка.СубконтоДт, 2, СтрокаЗатрат.Субконто2);
		ОбщегоНазначения.УстановитьСубконто(СтрокаЗатрат.СчетЗатрат, Проводка.СубконтоДт, 3, СтрокаЗатрат.Субконто3);
		
		Проводка.СчетКт = СтрокаЗатрат.СчетАмортизации;

		Если СтруктураШапкиДокумента.ЕстьНалогНаПрибыльДо2015 Тогда               
			Проводка.СуммаНУКт      = СтрокаЗатрат.СуммаНУ;
			Проводка.НалоговоеНазначениеКт      = СтрокаЗатрат.НалоговоеНазначение;
		Иначе
			Если Проводка.СчетКт.УчетСуммНУ Тогда
				Проводка.СуммаНУКт      = СтрокаЗатрат.СуммаНУ;
			КонецЕсли; 
			Проводка.НалоговоеНазначениеКт      = СтрокаЗатрат.НалоговоеНазначение;
		КонецЕсли;
		
		Проводка.КоличествоКт = СтрокаЗатрат.Количество;
		ОбщегоНазначения.УстановитьСубконто(СтрокаЗатрат.СчетАмортизации, Проводка.СубконтоКт, "Номенклатура", СтрокаЗатрат.ОбъектУчета);
		ОбщегоНазначения.УстановитьСубконто(СтрокаЗатрат.СчетАмортизации, Проводка.СубконтоКт, "НоменклатурныеПозиции", СтрокаЗатрат.НоменклатурнаяПозиция);
		ОбщегоНазначения.УстановитьСубконто(СтрокаЗатрат.СчетАмортизации, Проводка.СубконтоКт, "Партии"      , СтрокаЗатрат.Партия);
		ОбщегоНазначения.УстановитьСубконто(СтрокаЗатрат.СчетАмортизации, Проводка.СубконтоКт, "Склады"      , СтрокаЗатрат.Склад);
		
	КонецЦикла;

	// Отражение амортизации на 09 счете
	
	СуммаПроводки = СуммаНа09Счет;
	
	Если СуммаПроводки <> 0 Тогда
		
		Проводка = Проводки.Добавить();
		
		Проводка.Период       = ДатаРасчета;
		Проводка.Содержание   = "Отражение амортизации на 09 счете";
		Проводка.НомерЖурнала = НомерЖурнала;
		Проводка.Организация  = СтруктураШапкиДокумента.Организация;
		Проводка.Сумма        = СуммаПроводки;
		
		Проводка.СчетДт = ПланыСчетов.Хозрасчетный.АмортизационныеОтчисления;
		
	КонецЕсли;
	
	Возврат ТабЗатрат;

КонецФункции // ПолучитьРаспределениеПогашенияСтоимости()

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ СПИСАНИЯ ПАРТИЙ МАЛОЦЕНКИ

// Добавляет строку в ТаблицуСообщений
//
// Параметры
//    ТипУчета – Тип: Строка –  тип учета (1.Упр, 2.Бух, 3.Нал)
//                 
//    ОсталосьСписать – Тип: Число – Сколько не списано по партиям
//                 
//    СтрокаТЧ – Тип: Строка таблицы значений – строка табличной части
//                 
//    ТаблицаСообщений – Тип: ТаблицаЗначений – таблица сообщений
//                 
//
Процедура ДобавитьИнформациюДляСообщений(ОсталосьСписать, СтрокаТЧ, ТаблицаСообщений)

	НоваяСтрока = ТаблицаСообщений.Добавить();
	НоваяСтрока.НомерСтрокиДокумента          = СтрокаТЧ.НомерСтрокиДокумента;
	НоваяСтрока.ОсталосьСписать               = ОсталосьСписать;
	НоваяСтрока.СтрокаТаблицы                 = СтрокаТЧ;

КонецПроцедуры // ДобавитьИнформациюДляСообщений()

// Процедура очищает значения структуры ключевых полей
// 
Процедура ОчиститьЗначенияСтруктурыКлючевыхПолей(СтруктураКлючевыхПолей)

	Для каждого КлючЗначение Из СтруктураКлючевыхПолей Цикл
	
		СтруктураКлючевыхПолей.Вставить(КлючЗначение.Ключ, Неопределено);	
	
	КонецЦикла;	

КонецПроцедуры // ОчиститьЗначенияСтруктурыКлючевыхПолей()

// Функция проверяет, изменились ли ключевые поля в строке табличной части
// по отношению к текущим значениям. Если изменились то изменяет текущие значения
//
// Параметры
// 	СтрокаТЧ  – Тип:Строка таблицы значений – строка для проверки 
//                 
//  СтруктураКлючевыхПолей  – Тип: Структура – структура текущих значений
//                 
//
// Возвращаемое значение:
//   Тип: Булево  –  Истина, если изменились поля
//
Функция ИзменилисьКлючевыеПоля(СтрокаТЧ, СтруктураКлючевыхПолей)

	Результат = Ложь;
	
	Для каждого КлючЗначение Из СтруктураКлючевыхПолей Цикл
		
		ИмяКолонки = КлючЗначение.Ключ;
		
		Если СтрокаТЧ[ИмяКолонки] <> КлючЗначение.Значение Тогда
			
			 СтруктураКлючевыхПолей.Вставить(ИмяКолонки, СтрокаТЧ[ИмяКолонки]);
			 Результат = Истина;
			
		КонецЕсли;			
	
	КонецЦикла;
	
	Возврат Результат;

КонецФункции // ИзменилисьКлючевыеПоля()

// Копирует строку таблицы значений
//
Процедура СкопироватьСтроку(СтрокаОткуда, СтрокаКуда, КоличествоКолонок)

	Для Н = 0 По КоличествоКолонок - 1 Цикл
	
		СтрокаКуда[Н] = СтрокаОткуда[Н];	
	
	КонецЦикла;	

КонецПроцедуры // СкопироватьСтроку()

// Заполняет строку таблицы движения необходимыми значениями для списания партии
//
Процедура СписатьПартиюМалоценки(ТипУчета, КоэфСписания, СтруктураОстатков, СтрокаТЧ, Выборка, СтруктураШапкиДокумента, ТаблицаДвижений, Проводки)
	
	Если ТипУчета = "Упр" Тогда
		
		// Заполнение полей списания
	    СтрокаРасхода = ТаблицаДвижений.Добавить();
		
		СтрокаРасхода.Активность  = Истина;
		СтрокаРасхода.Период      = СтрокаТЧ.Период;
		СтрокаРасхода.ВидДвижения = ВидДвиженияНакопления.Расход;
		
		СтрокаРасхода.Подразделение                = СтруктураШапкиДокумента.Подразделение;
		СтрокаРасхода.Номенклатура                 = Выборка.Номенклатура;
		СтрокаРасхода.ХарактеристикаНоменклатуры   = Выборка.ХарактеристикаНоменклатуры;
		СтрокаРасхода.СерияНоменклатуры            = Выборка.СерияНоменклатуры;
		СтрокаРасхода.ФизЛицо                      = Выборка.ФизЛицо;
		СтрокаРасхода.НазначениеИспользования      = Выборка.НазначениеИспользования;
		СтрокаРасхода.Качество                     = Выборка.Качество;
		СтрокаРасхода.ПартияМалоценкиВЭксплуатации = Выборка.ПартияМалоценкиВЭксплуатации;
		СтрокаРасхода.ДокументОприходования        = Выборка.ДокументОприходования;
		
		СтрокаРасхода.КодОперации          = СтрокаТЧ.КодОперации;
		СтрокаРасхода.СписаниеПартий       = Истина;
		СтрокаРасхода.НомерСтрокиДокумента = СтрокаТЧ.НомерСтрокиДокумента;
		
		Для каждого КлючЗначение Из СтруктураОстатков Цикл
		
			ИмяПоля                = КлючЗначение.Ключ;
			СтрокаРасхода[ИмяПоля] = КоэфСписания * КлючЗначение.Значение;
			СтруктураОстатков.Вставить(ИмяПоля, КлючЗначение.Значение - СтрокаРасхода[ИмяПоля]); 
	
		КонецЦикла;
		
		// Особенности поведения, зависимые от вида операции
		Если СтрокаТЧ.КодОперации = Перечисления.КодыОперацийПартииМалоценкиВЭксплуатации.ПеремещениеВЭксплуатации Тогда
			
			СтрокаПрихода = ТаблицаДвижений.Добавить();
			СкопироватьСтроку(СтрокаРасхода, СтрокаПрихода, ТаблицаДвижений.Колонки.Количество());
						
			СтрокаПрихода.ВидДвижения             = ВидДвиженияНакопления.Приход;
			СтрокаПрихода.ФизЛицо                 = СтрокаТЧ.ФизЛицоКуда;
			СтрокаПрихода.НазначениеИспользования = СтрокаТЧ.НазначениеИспользованияНовое;
			
		КонецЕсли;
		
	ИначеЕсли ТипУчета = "Бух" Тогда
		
		ДатаДока     = СтруктураШапкиДокумента.Дата;
		Организация  = СтруктураШапкиДокумента.Организация;
		НомерЖурнала = "МЦ";
		
		СуммаПроводки               = КоэфСписания * СтруктураОстатков.Стоимость;
		СтруктураОстатков.Стоимость = СтруктураОстатков.Стоимость - СуммаПроводки;
		
		СуммаПроводкиНУ               = КоэфСписания * СтруктураОстатков.СтоимостьНУ;
		СтруктураОстатков.СтоимостьНУ = СтруктураОстатков.СтоимостьНУ - СуммаПроводкиНУ;
		
		КоличествоПроводки           = КоэфСписания * СтруктураОстатков.Количество;
		СтруктураОстатков.Количество = СтруктураОстатков.Количество - КоличествоПроводки;
		
		Если СтруктураШапкиДокумента.КодОперации = "Перемещение" Тогда
			
			Содержание = "Перемещение малоценки в эксплуатации";
			
		Иначе // Списание
			
			Содержание = "Списание малоценки из эксплуатации";
			
		КонецЕсли;
		
		// Списание со счета МЦ
		Проводка = Проводки.Добавить();
		
		Проводка.Период       = ДатаДока;
		Проводка.Содержание   = Содержание;
		Проводка.НомерЖурнала = НомерЖурнала;
		Проводка.Организация  = Организация;
		Проводка.Сумма        = СуммаПроводки;
				
		Проводка.СуммаНУДт      = СуммаПроводкиНУ;
		Проводка.НалоговоеНазначениеДт      = Выборка.НалоговоеНазначение;
		
		Если СтруктураШапкиДокумента.КодОперации = "Перемещение" Тогда
			
			Проводка.СчетДт = ПланыСчетов.Хозрасчетный.МалоценныеАктивыВЭксплуатации;
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "РаботникиОрганизаций"        , СтруктураШапкиДокумента.ФизЛицоКуда);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "НазначенияИспользования"     , СтрокаТЧ.НазначениеИспользованияНовое);
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "ПартииМалоценкиВЭксплуатации", Выборка.ПартияМалоценкиВЭксплуатации);
			
			//Дандали В. 11.10
			ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Склады" , СтруктураШапкиДокумента.Склад);
			//Дандали В. 11.10
			
			Проводка.КоличествоДт = КоличествоПроводки;
			
		КонецЕсли;
		
		Проводка.СуммаНУКт      = СуммаПроводкиНУ;
		Проводка.НалоговоеНазначениеКт      = Выборка.НалоговоеНазначение;
		
		Проводка.СчетКт = ПланыСчетов.Хозрасчетный.МалоценныеАктивыВЭксплуатации;
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "РаботникиОрганизаций"        , Выборка.ФизЛицо);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НазначенияИспользования"     , Выборка.НазначениеИспользования);
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "ПартииМалоценкиВЭксплуатации", Выборка.ПартияМалоценкиВЭксплуатации);
		
		//Дандали В. 11.10
		ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Склады" , СтруктураШапкиДокумента.Склад);
		//Дандали В. 11.10
		
		Проводка.КоличествоКт = КоличествоПроводки;

		Если (Выборка.ВидМалоценки <> Перечисления.ВидыМалоценки.МалоценныйБыстроизнашивающийсяПредмет) Тогда
			
			// Особенности поведения, зависимые от вида операции
			Если СтруктураШапкиДокумента.КодОперации = "Перемещение" Тогда
				
				Если  Выборка.НазначениеИспользования <> СтрокаТЧ.НазначениеИспользованияНовое Тогда
					// возможно нужны корректировочные проводки
					
					Если СтрокаТЧ.СчетПередачиБУ <> СтрокаТЧ.СчетПередачиБУНовый Тогда
						
						// проводка нужна даже если СуммаПроводки = 0,
						// потому что есть количество
						Проводка = Проводки.Добавить();
						
						Проводка.Период       = ДатаДока;
						Проводка.Содержание   = Содержание;
						Проводка.НомерЖурнала = НомерЖурнала;
						Проводка.Организация  = Организация;
						Проводка.Сумма        = СуммаПроводки;
						
						Проводка.СчетДт = СтрокаТЧ.СчетПередачиБУНовый;
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура", СтрокаТЧ.Номенклатура);
						Проводка.КоличествоДт = КоличествоПроводки;
						
						Проводка.СчетКт = СтрокаТЧ.СчетПередачиБУ;
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура", СтрокаТЧ.Номенклатура);
						Проводка.КоличествоКт = КоличествоПроводки;
						
					КонецЕсли;
					
					Если (СтрокаТЧ.СчетАмортизацииБУ <> СтрокаТЧ.СчетАмортизацииБУНовый) И (СуммаПроводки <> 0) Тогда
						
						// проводка нужна даже если СуммаПроводки = 0,
						// потому что есть количество
						Проводка = Проводки.Добавить();
						
						Проводка.Период       = ДатаДока;
						Проводка.Содержание   = Содержание;
						Проводка.НомерЖурнала = НомерЖурнала;
						Проводка.Организация  = Организация;
						Проводка.Сумма        = СуммаПроводки;
						
						Проводка.СчетДт = СтрокаТЧ.СчетАмортизацииБУ;
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура", СтрокаТЧ.Номенклатура);
						
						Проводка.СчетКт = СтрокаТЧ.СчетАмортизацииБУНовый;
						ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура", СтрокаТЧ.Номенклатура);
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе // Списание
				
				// Нужно погасить амортизацию для необоротных активов
				
				// проводка нужна даже если СуммаПроводки = 0,
				// потому что есть количество
				Проводка = Проводки.Добавить();
				
				Проводка.Период       = ДатаДока;
				Проводка.Содержание   = Содержание;
				Проводка.НомерЖурнала = НомерЖурнала;
				Проводка.Организация  = Организация;
				Проводка.Сумма        = СуммаПроводки;
				
				Проводка.СуммаНУДт      = СуммаПроводкиНУ;
				Проводка.НалоговоеНазначениеДт      = Выборка.НалоговоеНазначение;
				
				Проводка.СчетДт = СтрокаТЧ.СчетАмортизацииБУ;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, "Номенклатура", СтрокаТЧ.Номенклатура);
				
				Проводка.СуммаНУКт      = СуммаПроводкиНУ;
				Проводка.НалоговоеНазначениеКт      = Выборка.НалоговоеНазначение;
				
				Проводка.СчетКт = СтрокаТЧ.СчетПередачиБУ;
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "Номенклатура", СтрокаТЧ.Номенклатура);
				ОбщегоНазначения.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "НоменклатурныеПозиции",  СтрокаТЧ.НоменклатурнаяПозиция);
				Проводка.КоличествоКт = КоличествоПроводки;
				
			КонецЕсли;
			
		КонецЕсли;                    
		
	КонецЕсли;
	
КонецПроцедуры // СписатьПартиюМалоценки()

// Заполняет структуру остатков по выборке
//
Процедура ЗаполнитьСтруктуруОстатков(СтруктураОстатков, Выборка, ЭтоНалоговыйУчет = Ложь)

	СтруктураОстатков.Вставить("Количество", Выборка.Количество);
	СтруктураОстатков.Вставить("Стоимость" , Выборка.Стоимость);
	Если ЭтоНалоговыйУчет Тогда
		СтруктураОстатков.Вставить("СтоимостьНУ" , Выборка.СтоимостьНУ);
	КонецЕсли;	

КонецПроцедуры // ЗаполнитьСтруктуруОстатков()

// Производит заполнение таблицы движений для загрузки в набор движений
//
Процедура ПроизвестиСписаниеМалоценки(ТипУчета, СтруктураШапкиДокумента, СтруктураКлючевыхПолей, Выборка, 
	                                  ТаблицаДвижений, ТаблицаДокумента, ТаблицаСообщений, Проводки = Неопределено)

	СтруктураОстатков = Новый Структура;
	ОчиститьЗначенияСтруктурыКлючевыхПолей(СтруктураКлючевыхПолей);
	
	ЭтоНалоговыйУчет  = (ТипУчета = "Бух");
	
	//Обход таблицы документа и списание партий
	Для каждого СтрокаТЧ Из ТаблицаДокумента Цикл
		
		ОсталосьСписать = СтрокаТЧ.Количество;
	
		Если ИзменилисьКлючевыеПоля(СтрокаТЧ, СтруктураКлючевыхПолей) Тогда
			
			// Сброс выборки. Это несколько замедляет работу, но более надежно
			Выборка.Сбросить();
			
			Если НЕ Выборка.НайтиСледующий(СтруктураКлючевыхПолей) Тогда
				
				// Нет необходимых остатков
				ДобавитьИнформациюДляСообщений(ОсталосьСписать, СтрокаТЧ, ТаблицаСообщений);
				СтруктураОстатков.Очистить();
				СтруктураОстатков.Вставить("Количество", 0);
				Продолжить;
				
			КонецЕсли;
			
			ЗаполнитьСтруктуруОстатков(СтруктураОстатков, Выборка, ЭтоНалоговыйУчет);
			
		КонецЕсли;
		
		Пока ОсталосьСписать > 0 Цикл
			
			Остаток = СтруктураОстатков.Количество;
			
			Если Остаток <= 0 Тогда
				
				Если НЕ Выборка.НайтиСледующий(СтруктураКлючевыхПолей) Тогда
					
					// Нет необходимых остатков
					ДобавитьИнформациюДляСообщений(ОсталосьСписать, СтрокаТЧ, ТаблицаСообщений);
					Прервать;
					
				КонецЕсли;
				
				ЗаполнитьСтруктуруОстатков(СтруктураОстатков, Выборка, ЭтоНалоговыйУчет);
				
			Иначе
				
				Если ОсталосьСписать < Остаток Тогда
					// Все количество спишется с текущей партии
					
					КоэфСписания    = ОсталосьСписать / Остаток;
					ОсталосьСписать = 0;
					
				Иначе
					// Остаток меньше или равен тому, что нужно списать
					// списываем все
					КоэфСписания = 1;
					ОсталосьСписать = ОсталосьСписать - Остаток;
					
				КонецЕсли;	
				
				СписатьПартиюМалоценки(ТипУчета, КоэфСписания, СтруктураОстатков, СтрокаТЧ, Выборка, СтруктураШапкиДокумента, ТаблицаДвижений, Проводки);
			
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЦикла;
	
	Если ТаблицаДвижений <> Неопределено Тогда 
		ТаблицаДвижений.Сортировать("ВидДвижения Убыв, НомерСтрокиДокумента"); 
	КонецЕсли;

КонецПроцедуры // ПроизвестиСписаниеМалоценки()

// Процедура проводит переданный документ по учету партий малоценки
//
// Параметры
//  ОбрабатываемыйДокумент - ДокументСсылка - проводимый документ
//  ТаблицаДокумента – ТаблицаЗначение – содержит таблицу проведения документа
//
Процедура ДвижениеПартийМалоценки(СтруктураШапкиДокумента, ТаблицаДокумента, Отказ, Заголовок, ОтражатьВУправленческомУчете = Истина, ОтражатьВБухгалтерскомУчете = Ложь) Экспорт
	
	Если ТаблицаДокумента.Количество() = 0 Тогда
		
		//Нечего делать
		Возврат;
	 	                           
	КонецЕсли;
	
	Если ТаблицаДокумента.Колонки.Найти("НомерСтрокиДокумента") = Неопределено Тогда 
		
		ТаблицаДокумента.Колонки.НомерСтроки.Имя = "НомерСтрокиДокумента";
		
	КонецЕсли; 
	
	// Заполнение необходимых переменных
	Организация              = СтруктураШапкиДокумента.Организация;
	Подразделение            = СтруктураШапкиДокумента.Подразделение;
	ПодразделениеОрганизации = СтруктураШапкиДокумента.ПодразделениеОрганизации;
	УказыватьПартию          = СтруктураШапкиДокумента.УказыватьПартию;
	ОбрабатываемыйДокумент   = СтруктураШапкиДокумента.Ссылка;
	
	//Дандали В. 10.10.2023
	Склад = СтруктураШапкиДокумента.Склад;
	//Дандали В. 10.10.2023
	
	Если ОтражатьВБухгалтерскомУчете Тогда
		
		// бухгалтерский учет
		ПроводкиБУ     = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
		ПроводкиБУ.Отбор.Регистратор.Значение = ОбрабатываемыйДокумент;
		
		// Создание таблицы сообщений.
		// Эта таблица будет накопливать информацию для сообщений пользователю
		// Списание партий не всегда будет совпадать с порядком следования                            
		// строк в документе, а сообщения  пользователю удобно получать
		// в этом порядке
		ТаблицаСообщений = Новый ТаблицаЗначений;
		ТаблицаСообщений.Колонки.Добавить("НомерСтрокиДокумента", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,0));
		ТаблицаСообщений.Колонки.Добавить("ОсталосьСписать"     , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,3));
		ТаблицаСообщений.Колонки.Добавить("СтрокаТаблицы");
	
		// Создание структуры ключевых измерений
		СтруктураКлючевыхПолей = Новый Структура;
		СтруктураКлючевыхПолей.Вставить("ФизЛицо"                , "Субконто1");
		СтруктураКлючевыхПолей.Вставить("НазначениеИспользования", "Субконто2");
		
		СтруктураКлючевыхПолей.Вставить("НалоговоеНазначение", "НалоговоеНазначение");
		
		Если УказыватьПартию Тогда                                          
		
			СтруктураКлючевыхПолей.Вставить("ПартияМалоценкиВЭксплуатации", "Субконто3");
		
		КонецЕсли;
	
		// Создание строки ключевых колонок для таблицы
		СтрокаКолонок = "";
		Разделитель   = "";
	
		Для каждого КлючЗначение Из СтруктураКлючевыхПолей Цикл
	
			СтрокаКолонок = СтрокаКолонок + Разделитель + КлючЗначение.Ключ;
			Разделитель = ",";
	
		КонецЦикла;
	
		// Создание запроса
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НаДату"                  , ОбрабатываемыйДокумент.МоментВремени());
		Запрос.УстановитьПараметр("Организация"             , Организация);
		Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПодразделениеОрганизации);
	
		Запрос.УстановитьПараметр("СчетМЦ", ПланыСчетов.Хозрасчетный.МалоценныеАктивыВЭксплуатации);
	
		МассивСубконтоМЦ = Новый Массив(3);
		МассивСубконтоМЦ[0] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций;
		МассивСубконтоМЦ[1] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НазначенияИспользования;
		МассивСубконтоМЦ[2] = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПартииМалоценкиВЭксплуатации;
		Запрос.УстановитьПараметр("СубконтоМЦ", МассивСубконтоМЦ);
	
		// Создание фильтра для остатков регистра
		СтрокаФильтра = "";
		Разделитель   = Символы.ПС + " И ";
	
		Для каждого КлючЗначение Из СтруктураКлючевыхПолей Цикл
		
			ИмяПеременной = КлючЗначение.Ключ;
			МассивОтбора  = ТаблицаДокумента.ВыгрузитьКолонку(ИмяПеременной);
			ОбщегоНазначения.УдалитьПовторяющиесяЭлементы(МассивОтбора);
		
			Если МассивОтбора.Количество() = 1 Тогда
			
				СтрокаФильтра = СтрокаФильтра + Разделитель 
							+ КлючЗначение.Значение + " = &" + ИмяПеременной;
				Запрос.УстановитьПараметр(ИмяПеременной, МассивОтбора[0]);
			
			Иначе
			
				СтрокаФильтра = СтрокаФильтра + Разделитель 
							+ КлючЗначение.Значение + " В (&" + ИмяПеременной + ")";
				Запрос.УстановитьПараметр(ИмяПеременной, МассивОтбора);
			
			КонецЕсли;
		
		КонецЦикла;
	
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Субконто1           КАК ФизЛицо,
		|	ХозрасчетныйОстатки.Субконто2           КАК НазначениеИспользования,
		|	ХозрасчетныйОстатки.Субконто3           КАК ПартияМалоценкиВЭксплуатации,
		|	ХозрасчетныйОстатки.НалоговоеНазначение 		КАК НалоговоеНазначение,
		|	ХозрасчетныйОстатки.Субконто2.ВидМалоценки      КАК ВидМалоценки,
		|	ХозрасчетныйОстатки.КоличествоОстатокДт КАК Количество,
		|	ХозрасчетныйОстатки.СуммаОстатокДт      КАК Стоимость,
		|	ХозрасчетныйОстатки.СуммаНУОстатокДт    КАК СтоимостьНУ
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|		               &НаДату,
		|		               Счет = &СчетМЦ,
		|		               &СубконтоМЦ,
		|		               Организация = &Организация"
		//|		               И Субконто3.ПодразделениеОрганизации = &ПодразделениеОрганизации" 
		                       + СтрокаФильтра + ") КАК ХозрасчетныйОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицо,
		|	НазначениеИспользования,
		|	ПартияМалоценкиВЭксплуатации
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Результат = Запрос.Выполнить();
		Выборка   = Результат.Выбрать();
		
		// Сортировка таблицы документа
		// Это необходимо на тот случай, если в документе
		// есть строки с повторяющимися ключевыми полями
		ТаблицаДокумента.Сортировать(СтрокаКолонок);
			
		Если НЕ Результат.Пустой() Тогда
			
			ПроизвестиСписаниеМалоценки("Бух", СтруктураШапкиДокумента, СтруктураКлючевыхПолей, Выборка, 
		                                     Неопределено, ТаблицаДокумента, ТаблицаСообщений, ПроводкиБУ);			
		Иначе
			// списывать нечего
			
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Бух. учет: По партиям ничего не списано, из-за отсутствия соответствующих остатков';uk='Бух. облік: По партіях нічого не списано, через відсутність відповідних залишків'"), Отказ, Заголовок);
			
		КонецЕсли;
		
		// вывод сообщений об ошибках
		Если ТаблицаСообщений.Количество() > 0 Тогда
			
			Если ЗначениеЗаполнено(Заголовок) Тогда
				
				// Ранее сообщения не выводились
				ОбщегоНазначения.СообщитьОбОшибке(Заголовок);
				
			КонецЕсли;
			
			ТаблицаСообщений.Сортировать("НомерСтрокиДокумента");
			ТекущийНомерСтроки = 0;
			
			Для каждого СтрокаСообщений Из ТаблицаСообщений Цикл
			                                                                                         
				Если ТекущийНомерСтроки <> СтрокаСообщений.НомерСтрокиДокумента Тогда
					
					ТекущийНомерСтроки = СтрокаСообщений.НомерСтрокиДокумента;
					СтрокаТЧ           = СтрокаСообщений.СтрокаТаблицы;
					ЕдиницаИзмерения   = СтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков;
					Заголовок = НСтр("ru='Строка номер ';uk='Рядок номер '") + ТекущийНомерСтроки 
					            + Символы.ПС+ СтрокаТЧ.ФизЛицо  + ", " + СтрокаТЧ.Номенклатура
							    + ", " + СтрокаТЧ.НазначениеИспользования + ":";
					
				КонецЕсли;	
				
				ОбщегоНазначения.СообщитьОбОшибке(Символы.Таб + НСтр("ru='Бух. учет: Не списано по партиям ';uk='Бух. облік: Не списано по партіях '")
				                 + СтрокаСообщений.ОсталосьСписать + " " + ЕдиницаИзмерения, Отказ, Заголовок);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			// Запись движений
			ПроводкиБУ.Записать();
		КонецЕсли;
		
	ИначеЕсли ОтражатьВУправленческомУчете Тогда
		
		// управленческий учет
		НаборЗаписейУУ = РегистрыНакопления.ПартииМалоценкиВЭксплуатации.СоздатьНаборЗаписей();
		НаборЗаписейУУ.Отбор.Регистратор.Значение = ОбрабатываемыйДокумент;
		
		// Создание таблицы сообщений.
		// Эта таблица будет накопливать информацию для сообщений пользователю
		// Списание партий не всегда будет совпадать с порядком следования                            
		// строк в документе, а сообщения  пользователю удобно получать
		// в этом порядке
		ТаблицаСообщений = Новый ТаблицаЗначений;
		ТаблицаСообщений.Колонки.Добавить("НомерСтрокиДокумента", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,0));
		ТаблицаСообщений.Колонки.Добавить("ОсталосьСписать"     , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,3));
		ТаблицаСообщений.Колонки.Добавить("СтрокаТаблицы");
		
		// Создание структуры ключевых измерений
		СтруктураКлючевыхПолей = Новый Структура;
		СтруктураКлючевыхПолей.Вставить("Номенклатура");
		СтруктураКлючевыхПолей.Вставить("ХарактеристикаНоменклатуры");
		СтруктураКлючевыхПолей.Вставить("СерияНоменклатуры");
		СтруктураКлючевыхПолей.Вставить("НазначениеИспользования");
		СтруктураКлючевыхПолей.Вставить("ФизЛицо");
		СтруктураКлючевыхПолей.Вставить("Качество");
				
		Если УказыватьПартию Тогда
			
			СтруктураКлючевыхПолей.Вставить("ПартияМалоценкиВЭксплуатации");
			
		КонецЕсли;
		
		// Создание строки ключевых колонок для таблицы
		СтрокаКолонок = "";
		Разделитель   = "";
		
		Для каждого КлючЗначение Из СтруктураКлючевыхПолей Цикл
		
			СтрокаКолонок = СтрокаКолонок + Разделитель + КлючЗначение.Ключ;
			Разделитель = ",";
		
		КонецЦикла;
		
		// Создание запроса
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НаДату"                  , ОбрабатываемыйДокумент.МоментВремени());
		Запрос.УстановитьПараметр("Регистратор"             , ОбрабатываемыйДокумент);
		Запрос.УстановитьПараметр("Подразделение"           , Подразделение);
		Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПодразделениеОрганизации);
		
		// Создание фильтра для остатков регистра
		СтрокаФильтра  = "";
		Разделитель    = Символы.ПС + " И ";
		
		Для каждого КлючЗначение Из СтруктураКлючевыхПолей Цикл
			
			ИмяПеременной = КлючЗначение.Ключ;
			МассивОтбора  = ТаблицаДокумента.ВыгрузитьКолонку(ИмяПеременной);
			ОбщегоНазначения.УдалитьПовторяющиесяЭлементы(МассивОтбора);
			
			Если МассивОтбора.Количество() = 1 Тогда
				
				СтрокаФильтра = СтрокаФильтра + Разделитель 
								+ ИмяПеременной + " = &" + ИмяПеременной;
				Запрос.УстановитьПараметр(ИмяПеременной, МассивОтбора[0]);
				
			Иначе
				
				СтрокаФильтра = СтрокаФильтра + Разделитель 
								+ ИмяПеременной + " В (&" + ИмяПеременной + ")";
				Запрос.УстановитьПараметр(ИмяПеременной, МассивОтбора);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СписаннаяМалоценка.Номенклатура                              КАК Номенклатура,
		|	СписаннаяМалоценка.ХарактеристикаНоменклатуры                КАК ХарактеристикаНоменклатуры,
		|	СписаннаяМалоценка.СерияНоменклатуры                         КАК СерияНоменклатуры,
		|	СписаннаяМалоценка.ФизЛицо                                   КАК ФизЛицо,
		|	СписаннаяМалоценка.НазначениеИспользования                   КАК НазначениеИспользования,
		|	СписаннаяМалоценка.Качество                                  КАК Качество,
		|	СписаннаяМалоценка.НазначениеИспользования.ВидМалоценки      КАК ВидМалоценки,
		|	СписаннаяМалоценка.НазначениеИспользования.СчетПередачиБУ    КАК СчетПередачиБУ,
		|	СписаннаяМалоценка.НазначениеИспользования.СчетАмортизацииБУ КАК СчетАмортизацииБУ,
		|	Партии.ПартияМалоценкиВЭксплуатации                          КАК ПартияМалоценкиВЭксплуатации,
		|	Партии.ДокументОприходования                                 КАК ДокументОприходования,
		|	ЕСТЬNULL(Партии.Количество, 0)                               КАК Количество,
		|	ЕСТЬNULL(Партии.Стоимость, 0)                                КАК Стоимость
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		СписаннаяМалоценка.Номенклатура               КАК Номенклатура,
		|		СписаннаяМалоценка.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|		СписаннаяМалоценка.СерияНоменклатуры          КАК СерияНоменклатуры,
		|		СписаннаяМалоценка.ФизЛицо                    КАК ФизЛицо,
		|		СписаннаяМалоценка.НазначениеИспользования    КАК НазначениеИспользования,
		|		СписаннаяМалоценка.Качество                   КАК Качество
		|	ИЗ
		|		РегистрСведений.СписаннаяМалоценкаВЭксплуатации КАК СписаннаяМалоценка
		|	ГДЕ
		|		СписаннаяМалоценка.Регистратор = &Регистратор) КАК СписаннаяМалоценка
		|		ЛЕВОЕ СОЕДИНЕНИЕ
		|		(
		|		ВЫБРАТЬ
		|			ПартииУУ.Номенклатура                 КАК Номенклатура,
		|			ПартииУУ.ХарактеристикаНоменклатуры   КАК ХарактеристикаНоменклатуры,
		|			ПартииУУ.СерияНоменклатуры            КАК СерияНоменклатуры,
		|			ПартииУУ.ФизЛицо                      КАК ФизЛицо,
		|			ПартииУУ.НазначениеИспользования      КАК НазначениеИспользования,
		|			ПартииУУ.Качество                     КАК Качество,
		|			ПартииУУ.ПартияМалоценкиВЭксплуатации КАК ПартияМалоценкиВЭксплуатации,
		|			ПартииУУ.ДокументОприходования        КАК ДокументОприходования,
		|			ПартииУУ.КоличествоОстаток            КАК Количество,
		|			ПартииУУ.СтоимостьОстаток             КАК Стоимость
		|		ИЗ
		|			РегистрНакопления.ПартииМалоценкиВЭксплуатации.Остатки(&НаДату, 
		|			                  Подразделение = &Подразделение " + СтрокаФильтра + ") КАК ПартииУУ
		|		) КАК Партии
		|		ПО СписаннаяМалоценка.Номенклатура                  = Партии.Номенклатура
		|			И СписаннаяМалоценка.ХарактеристикаНоменклатуры = Партии.ХарактеристикаНоменклатуры
		|			И СписаннаяМалоценка.СерияНоменклатуры          = Партии.СерияНоменклатуры
		|			И СписаннаяМалоценка.ФизЛицо                    = Партии.ФизЛицо
		|			И СписаннаяМалоценка.НазначениеИспользования    = Партии.НазначениеИспользования
		|			И СписаннаяМалоценка.Качество                   = Партии.Качество
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	ХарактеристикаНоменклатуры,
		|	СерияНоменклатуры,
		|	НазначениеИспользования,
		|	ФизЛицо,
		|	Качество,
		|	Партии.ПартияМалоценкиВЭксплуатации.МоментВремени,
		|	Партии.ДокументОприходования.МоментВремени";
		
		Результат = Запрос.Выполнить();
		Выборка   = Результат.Выбрать();
		
		// Сортировка таблицы документа
		// Это необходимо на тот случай, если в документе
		// есть строки с повторяющимися ключевыми полями
		ТаблицаДокумента.Сортировать(СтрокаКолонок);
			
		Если Выборка.Количество() > 0 Тогда
				
			ТаблицаДвиженийУУ   = НаборЗаписейУУ.Выгрузить();
			ПроизвестиСписаниеМалоценки("Упр", СтруктураШапкиДокумента, СтруктураКлючевыхПолей, Выборка, 
		                                     ТаблицаДвиженийУУ, ТаблицаДокумента, ТаблицаСообщений);
			НаборЗаписейУУ.Загрузить(ТаблицаДвиженийУУ);
				
		Иначе
				
			// списывать нечего
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Упр. учет: По партиям ничего не списано, из-за отсутствия соответствующих остатков';uk='Упр. облік: По партіях нічого не списано, через відсутність відповідних залишків'"), , Заголовок);
				
		КонецЕсли;
		
		// вывод сообщений об ошибках
		Если ТаблицаСообщений.Количество() > 0 Тогда
			
			Если ЗначениеЗаполнено(Заголовок) Тогда
				// Ранее сообщения не выводились
				
				ОбщегоНазначения.СообщитьОбОшибке(Заголовок);
				
			КонецЕсли;
			
			ТаблицаСообщений.Сортировать("НомерСтрокиДокумента");
			ТекущийНомерСтроки = 0;
			
			Для каждого СтрокаСообщений Из ТаблицаСообщений Цикл
			
				Если ТекущийНомерСтроки <> СтрокаСообщений.НомерСтрокиДокумента Тогда
					
					ТекущийНомерСтроки = СтрокаСообщений.НомерСтрокиДокумента;
					СтрокаТЧ           = СтрокаСообщений.СтрокаТаблицы;
					ЕдиницаИзмерения   = СтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков;
					Заголовок = НСтр("ru='Строка номер ';uk='Рядок номер '") + ТекущийНомерСтроки 
					            + Символы.ПС + УправлениеЗапасами.ПредставлениеНоменклатуры(Строка(СтрокаТЧ.Номенклатура),
								                                         Строка(СтрокаТЧ.ХарактеристикаНоменклатуры),
																		 Строка(СтрокаТЧ.СерияНоменклатуры))
							    + ", " + СтрокаТЧ.НазначениеИспользования + ", " + СтрокаТЧ.ФизЛицо + ", "
								+ СтрокаТЧ.Качество + ":";
					
				КонецЕсли;	
				
				ОбщегоНазначения.СообщитьОбОшибке(Символы.Таб + НСтр("ru='Упр учет: Не списано по партиям ';uk='Упр облік: Не списано по партіях '")
				                 + СтрокаСообщений.ОсталосьСписать + " " + ЕдиницаИзмерения, , Заголовок);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			// Запись движений
			НаборЗаписейУУ.Записать();
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры // ДвижениеПартийМалоценки()
